/*
Copyright (c) 2020 by Stevie. All Rights Reserved.
*/

export const V2XSceneMap = {
  'ICW' : '交叉路口碰撞预警',
  'FCW' : '前向碰撞预警',
  'LTA' :'左转辅助',
  'LCW' :'变道预警',
  'BSW' :'盲区预警',
  'DNPW':'逆向超车预警',
  'EBW' : '紧急制动预警',
  'AVW' : '异常车辆提醒',
  'CLW' :'车辆失控预警',
  'HLW' :'道路危险状况提醒',
  'SLW' :'限速预警',
  'RLVW':'闯红灯预警',
  'VRUCW' : '弱势交通参与者碰撞预警',
  'GLOSA' :'绿波车速引导',
  'TJW' :'前方拥堵预警',
  'EVW' :'紧急车辆提醒',
  'PREEMPT' :'特种车辆优先通行',
  'IVS-1':'交叉路口',
  'IVS-2':'急转弯',
  'IVS-3':'反向转弯',
  'IVS-4': '连续弯路' ,
  'IVS-5': '陡坡' ,
  'IVS-6': '连续下坡' ,
  'IVS-7': '窄路' ,
  'IVS-8': '窄桥' ,
  'IVS-9': '双向交通' ,
  'IVS-10': '注意行人' ,
  'IVS-11': '注意儿童' ,
  'IVS-12': '注意牲畜' ,
  'IVS-13': '注意野生动物' ,
  'IVS-14': '注意信号灯' ,
  'IVS-15': '注意落石' ,
  'IVS-16': '注意横风' ,
  'IVS-17': '易滑' ,
  'IVS-18': '傍山险路' ,
  'IVS-19': '堤坝路' ,
  'IVS-20': '村庄' ,
  'IVS-21': '隧道' ,
  'IVS-22': '渡口' ,
  'IVS-23': '驼峰桥' ,
  'IVS-24': '路面不平' ,
  'IVS-25': '路面高突' ,
  'IVS-26': '路面低洼' ,
  'IVS-27': '过水路面' ,
  'IVS-28': '有人看守铁道路口' ,
  'IVS-29': '无人看守铁道路口' ,
  'IVS-30': '叉形符号' ,
  'IVS-31': '斜杠符号' ,
  'IVS-32': '注意非机动车' ,
  'IVS-33': '注意残疾人' ,
  'IVS-34': '事故易发路段' ,
  'IVS-35': '慢行' ,
  'IVS-36': '注意障碍物' ,
  'IVS-37': '注意危险' ,
  'IVS-38': '施工' ,
  'IVS-39': '建议速度' ,
  'IVS-40': '隧道开车灯' ,
  'IVS-41': '注意潮汐车道' ,
  'IVS-42': '注意保持车距' ,
  'IVS-43': '注意分离式道路' ,
  'IVS-44': '注意合流' ,
  'IVS-45': '避险车道' ,
  'IVS-46': '注意路面结冰，注意雨（雪），注意雾天，注意不利气象条件' ,
  'IVS-47': '注意前方车辆排队',

  'IVS-101': '车辆故障' ,
  'IVS-102': '人车事故' ,
  'IVS-103': '车车事故' ,
  'IVS-104': '设施相关' ,
  'IVS-105': '注意前方车辆排队' ,
  'IVS-106': '车辆起火' ,
  'IVS-107': '撞动物' ,
  'IVS-108': '抛洒物' ,
  'IVS-111': '单车事故' ,
  'IVS-112': '多车事故' ,
  'IVS-131': '追尾' ,
  'IVS-132': '刮擦' ,
  'IVS-133': '翻车' ,
  'IVS-141': '撞固定物' ,
  'IVS-142': '船舶撞桥' ,
  'IVS-199': '其他',

  'IVS-201': '车辆火灾' ,
  'IVS-202': '路面火灾' ,
  'IVS-203': '路边火灾' ,
  'IVS-204': '隧道火灾' ,
  'IVS-205': '道路设施火灾' ,
  'IVS-206': '地质灾害' ,
  'IVS-207': '水灾' ,
  'IVS-208': '环境污染' ,
  'IVS-211': '路基沉陷' ,
  'IVS-212': '路面沉陷' ,
  'IVS-213': '泥石流' ,
  'IVS-214': '地震' ,
  'IVS-261': '山体滑坡' ,
  'IVS-262': '桥梁损坏' ,
  'IVS-263': '道路损坏' ,
  'IVS-264': '隧道塌方' ,
  'IVS-299': '其他' ,

  'IVS-301': '暴雨' ,
  'IVS-302': '冰雹' ,
  'IVS-303': '雷电' ,
  'IVS-304': '大风' ,
  'IVS-305': '大雾' ,
  'IVS-306': '高温' ,
  'IVS-307': '干旱' ,
  'IVS-308': '暴雪' ,
  'IVS-309': '寒潮' ,
  'IVS-310': '霜冻' ,
  'IVS-311': '霾' ,
  'IVS-399': '其他',

  'IVS-401': '散乱物体' ,
  'IVS-402': '液体' ,
  'IVS-403': '机油泄漏' ,
  'IVS-404': '道路障碍' ,
  'IVS-405': '人' ,
  'IVS-406': '动物' ,
  'IVS-407': '积水' ,
  'IVS-408': '湿滑' ,
  'IVS-409': '道路结冰' ,
  'IVS-410': '逆行车辆' ,
  'IVS-411': '非机动车' ,
  'IVS-412':'货物倾斜',
  'IVS-413': '货物散落' ,
  'IVS-414': '摩托车',
  'IVS-450': '倒车',
  'IVS-460': '停车' ,
  'IVS-434':'占用应急车道',
  'IVS-435':'慢行事件',
  'IVS-436': '机动车驶离事件',
  'IVS-437':'超速',
  'IVS-481':'路面高温',
  'IVS-482':'路面低温',
  'IVS-483':'路面积雪',
  'IVS-484': '路面凝雪',
  'IVS-499': '其他',

  'IVS-501': '占道施工' ,
  'IVS-502': '断路施工' ,
  'IVS-511': '日常养护（占道）',
  'IVS-512': '专项工程（占道）',
  'IVS-513': '临时抢修（占道）',
  'IVS-521': '日常养护（断路）',
  'IVS-522': '专项工程（断路）',
  'IVS-523': '临时抢修（断路）',
  'IVS-531': '专项工程（借道）',
  'IVS-532': '临时抢修（借道）',
  'IVS-541': '拓宽施工',
  'IVS-599': '其他' ,

  'IVS-601': '文体商业活动' ,
  'IVS-602': '外交政务活动' ,
  'IVS-699': '其他',

  'IVS-701': '燃气事故' ,
  'IVS-702': '化学污染' ,
  'IVS-703': '核事故' ,
  'IVS-704': '爆炸' ,
  'IVS-705': '电力事故' ,
  'IVS-706': '公共暴力' ,
  'IVS-707': '交通集中阻塞' ,
  'IVS-761': '恶意事件',
  'IVS-762': '群体事件',
  'IVS-799': '其他',

  'IVS-899': '其他',

  'IVS-951': '结构物预警',
  'IVS-952': '气象预警' ,
  'IVS-953': '交通状态预警' ,
  'IVS-954': '周边路网交通状态预警' ,
  'IVS-955':'其它交通事件预警' ,
  'IVS-961':'轻度拥堵' ,
  'IVS-962': '中度拥堵',
  'IVS-963': '严重拥堵',
  'IVS-971': '抛锚',
  'IVS-972': '爆胎',
  'IVS-981': '缺油',
  'IVS-982': '无停车位',
  'IVS-983': '服务区关闭',
  'IVS-990': '合流预警',
} as {[name:string]:string}


export const WeatherCode = {
'晴':'晴',

'少云':'多云',

'晴间多云':'晴间多云',

'多云':'多云',

'阴':'阴',

'有风':'有风',

'平静':'有风',

'微风':'有风',

'和风':'有风',

'清风':'有风',

'强风/劲风':'有风',

'疾风':'有风',

'大风':'有风',

'烈风':'有风',

'风暴':'有风',

'狂爆风':'有风',

'飓风':'有风',

'热带风暴':'有风',

'霾':'霾',

'中度霾':'霾',

'重度霾':'霾',

'严重霾':'霾',

'阵雨':'阵雨',

'雷阵雨':'雷阵雨',

'雷阵雨并伴有冰雹':'雷阵雨并伴有冰雹',

'小雨':'小雨',

'中雨':'中雨',

'大雨':'大雨',

'暴雨':'暴雨',

'大暴雨':'大暴雨',

'特大暴雨':'大暴雨',

'强阵雨':'阵雨',

'强雷阵雨':'雷阵雨',

'极端降雨':'大暴雨',

'毛毛雨/细雨':'小雨',

'雨':'中雨',

'小雨-中雨':'中雨',

'中雨-大雨':'大雨',

'大雨-暴雨':'暴雨',

'暴雨-大暴雨':'大暴雨',

'大暴雨-特大暴雨':'大暴雨',

'雨雪天气':'雨夹雪',

'雨夹雪':'雨夹雪',

'阵雨夹雪':'雨夹雪',

'冻雨':'冻雨',

'雪':'小雪',

'阵雪':'阵雪',

'小雪':'小雪',

'中雪':'中雪',

'大雪':'大雪',

'暴雪':'暴雪',

'小雪-中雪':'中雪',

'中雪-大雪':'大雪',

'大雪-暴雪':'暴雪',

'浮尘':'沙尘',

'扬沙':'扬沙',

'沙尘暴':'沙尘暴',

'强沙尘暴':'强沙尘暴',

'龙卷风':'有风',

'雾':'雾',

'浓雾':'雾',

'强浓雾':'雾',

'轻雾':'雾',

'大雾':'雾',

'特强浓雾':'雾' ,

'热':'温度',

'冷':'温度',

'未知':'温度',
}
